#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_api_gateway_deployment.deployment,
  on apigateway.tf line 193, in resource "aws_api_gateway_deployment" "deployment":
 193:   stage_name  = "dev"

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda_package: Reading...
data.archive_file.lambda_stop_package: Reading...
data.archive_file.lambda_package: Read complete after 0s [id=630a226dad94fe7240280f35ff7226b090613d12]
data.archive_file.lambda_stop_package: Read complete after 0s [id=ce274d6f6c9551ad12caf7e48a27e9e497d838ae]
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY]
aws_iam_group.nextjs_access_group: Refreshing state... [id=nextjs-access-group]
aws_iam_role.lambda_role: Refreshing state... [id=lambda-role]
aws_s3_bucket.transcript-bucket: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/lambda_policy]
aws_iam_user.nextjs_user: Refreshing state... [id=nextjs-access-user]
aws_iam_policy.stop_lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/stop_lambda_policy]
aws_api_gateway_rest_api.transcription_gateway: Refreshing state... [id=hzjgd3yz9g]
aws_api_gateway_rest_api.stop_ec2_gateway: Refreshing state... [id=1k9ub8vhk6]
aws_autoscaling_group.ton-texter-transcription-servers: Refreshing state... [id=ton-texter-transcription-servers]
aws_iam_group_policy_attachment.s3_access_attachment: Refreshing state... [id=nextjs-access-group-20250106183412668000000003]
aws_iam_group_policy_attachment.cloudwatch_access_attachment: Refreshing state... [id=nextjs-access-group-20250106183412653800000002]
aws_iam_user_group_membership.nextjs_user_membership: Refreshing state... [id=terraform-20250106183412629600000001]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=lambda-role-20231209192723088800000001]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"]: Refreshing state... [id=lambda-role-20231209192723097600000002]
aws_lambda_function.stop_lambda: Refreshing state... [id=stopEC2Function]
aws_lambda_function.start_lambda: Refreshing state... [id=startTranscriptionFunction]
aws_secretsmanager_secret_version.api_key_version: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY|terraform-20250127171953510900000001]
aws_api_gateway_resource.root: Refreshing state... [id=w3noxm]
aws_api_gateway_resource.stop_root: Refreshing state... [id=x1c8e2]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_method.options: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-OPTIONS]
aws_api_gateway_method.stop_proxy: Refreshing state... [id=agm-1k9ub8vhk6-x1c8e2-GET]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-OPTIONS]
aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_method_response.stop_proxy: Refreshing state... [id=agmr-1k9ub8vhk6-x1c8e2-GET-200]
aws_api_gateway_integration.stop_lambda_integration: Refreshing state... [id=agi-1k9ub8vhk6-x1c8e2-GET]
aws_lambda_permission.stop_apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration_response.options_integration_response: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_deployment.stop_deployment: Refreshing state... [id=f3wqgu]
aws_api_gateway_integration_response.stop_proxy: Refreshing state... [id=agir-1k9ub8vhk6-x1c8e2-GET-200]
aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_deployment.deployment: Refreshing state... [id=ey4o6i]
aws_api_gateway_stage.stop_dev: Refreshing state... [id=ags-1k9ub8vhk6-dev]
aws_s3_bucket_policy.transcript-bucket-policy: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_s3_bucket_cors_configuration.transcript-bucket-cors: Refreshing state... [id=transcript-bucket20231207181110470300000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.options_integration must be replaced
-/+ resource "aws_api_gateway_integration" "options_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "w3noxm" -> (known after apply)
      ~ id                      = "agi-hzjgd3yz9g-w3noxm-OPTIONS" -> (known after apply)
      + integration_http_method = "OPTIONS" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_function.start_lambda will be updated in-place
  ~ resource "aws_lambda_function" "start_lambda" {
        id                             = "startTranscriptionFunction"
      ~ last_modified                  = "2025-01-28T13:50:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "TLmqxaBLIA8YjiL8pa1s8/rmc4SwEbrVPfpeFaZ2POc=" -> "kq5HsorDrFfxcxARR5TbhQtFdi4tBtilx3xEPXf0L0g="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.stop_lambda will be updated in-place
  ~ resource "aws_lambda_function" "stop_lambda" {
        id                             = "stopEC2Function"
      ~ last_modified                  = "2025-01-27T17:19:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "TLmqxaBLIA8YjiL8pa1s8/rmc4SwEbrVPfpeFaZ2POc=" -> "kq5HsorDrFfxcxARR5TbhQtFdi4tBtilx3xEPXf0L0g="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_api_gateway_deployment.deployment,
  on apigateway.tf line 193, in resource "aws_api_gateway_deployment" "deployment":
 193:   stage_name  = "dev"

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hanneskoksch, Action: `pull_request`*